public/man/man1/gpasswd.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - gpasswd.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - gpasswd.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>gpasswd - administer /etc/group and /etc/gshadow</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>gpasswd</strong> [/option/] <em>group</em></p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <strong>gpasswd</strong> command is used to administer /etc/group, and
/etc/gshadow. Every group can have administrators, members and a
password.</p>
<p>
System administrators can use the <strong>-A</strong> option to define group
administrator(s) and the <strong>-M</strong> option to define members. They have all
rights of group administrators and members.</p>
<p>
<strong>gpasswd</strong> called by a group administrator with a group name only prompts
for the new password of the <em>group</em>.</p>
<p>
If a password is set the members can still use *newgrp*(1) without a
password, and non-members must supply the password.</p>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Notes about group passwords
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>Group passwords are an inherent security problem since more than one
person is permitted to know the password. However, groups are a useful
tool for permitting co-operation between different users.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
OPTIONS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Except for the <strong>-A</strong> and <strong>-M</strong> options, the options cannot be combined.</p>
<p>
The options which apply to the <strong>gpasswd</strong> command are:</p>
<p>
<strong>-a</strong>, <strong>–add</strong> <em>user</em></p>
<blockquote>
<p>Add the <em>user</em> to the named <em>group</em>.</p>
</blockquote>
<p>
<strong>-d</strong>, <strong>–delete</strong> <em>user</em></p>
<blockquote>
<p>Remove the <em>user</em> from the named <em>group</em>.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Display help message and exit.</p>
</blockquote>
<p>
<strong>-Q</strong>, <strong>–root</strong> <em>CHROOT_DIR</em></p>
<blockquote>
<p>Apply changes in the <em>CHROOT_DIR</em> directory and use the configuration
files from the <em>CHROOT_DIR</em> directory. Only absolute paths are
supported.</p>
</blockquote>
<p>
<strong>-r</strong>, <strong>–remove-password</strong></p>
<blockquote>
<p>Remove the password from the named <em>group</em>. The group password will be
empty. Only group members will be allowed to use <strong>newgrp</strong> to join the
named <em>group</em>.</p>
</blockquote>
<p>
<strong>-R</strong>, <strong>–restrict</strong></p>
<blockquote>
<p>Restrict the access to the named <em>group</em>. The group password is set to
&#34;!&#34;. Only group members with a password will be allowed to use <strong>newgrp</strong>
to join the named <em>group</em>.</p>
</blockquote>
<p>
<strong>-A</strong>, <strong>–administrators</strong> <em>user</em>,…</p>
<blockquote>
<p>Set the list of administrative users.</p>
</blockquote>
<p>
<strong>-M</strong>, <strong>–members</strong> <em>user</em>,…</p>
<blockquote>
<p>Set the list of group members.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
CAVEATS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>This tool only operates on the /etc/group and /etc/gshadow files. Thus
you cannot change any NIS or LDAP group. This must be performed on the
corresponding server.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
CONFIGURATION
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>The following configuration variables in /etc/login.defs change the
behavior of this tool:</p>
<p>
<strong>ENCRYPT_METHOD</strong> (string)</p>
<blockquote>
<p>This defines the system default encryption algorithm for encrypting
passwords (if no algorithm are specified on the command line).</p>
<p>
It can take one of these values: <em>BCRYPT</em>, <em>DES</em> (default), <em>MD5</em>,
<em>SHA256</em>, <em>SHA512</em>, <em>YESCRYPT</em>. MD5 and DES should not be used for new
hashes, see crypt(5) for recommendations.</p>
<p>
Note: this parameter overrides the <strong>MD5_CRYPT_ENAB</strong> variable.</p>
<p>
Note: This only affect the generation of group passwords. The generation
of user passwords is done by PAM and subject to the PAM configuration.
It is recommended to set this variable consistently with the PAM
configuration.</p>
</blockquote>
<p>
<strong>MAX_MEMBERS_PER_GROUP</strong> (number)</p>
<blockquote>
<p>Maximum members per group entry. When the maximum is reached, a new
group entry (line) is started in /etc/group (with the same name, same
password, and same GID).</p>
<p>
The default value is 0, meaning that there are no limits in the number
of members in a group.</p>
<p>
This feature (split group) permits to limit the length of lines in the
group file. This is useful to make sure that lines for NIS groups are
not larger than 1024 characters.</p>
<p>
If you need to enforce such limit, you can use 25.</p>
<p>
Note: split groups may not be supported by all tools (even in the Shadow
toolsuite). You should not use this variable unless you really need it.</p>
</blockquote>
<p>
<strong>MD5_CRYPT_ENAB</strong> (boolean)</p>
<blockquote>
<p>Indicate if passwords must be encrypted using the MD5-based algorithm.
If set to <em>yes</em>, new passwords will be encrypted using the MD5-based
algorithm compatible with the one used by recent releases of FreeBSD. It
supports passwords of unlimited length and longer salt strings. Set to
<em>no</em> if you need to copy encrypted passwords to other systems which dont
understand the new algorithm. Default is <em>no</em>.</p>
<p>
This variable is superseded by the <strong>ENCRYPT_METHOD</strong> variable or by any
command line option used to configure the encryption algorithm.</p>
<p>
This variable is deprecated. You should use <strong>ENCRYPT_METHOD</strong>.</p>
<p>
Note: This only affect the generation of group passwords. The generation
of user passwords is done by PAM and subject to the PAM configuration.
It is recommended to set this variable consistently with the PAM
configuration.</p>
</blockquote>
<p>
<strong>SHA_CRYPT_MIN_ROUNDS</strong> (number), <strong>SHA_CRYPT_MAX_ROUNDS</strong> (number)</p>
<blockquote>
<p>When <strong>ENCRYPT_METHOD</strong> is set to <em>SHA256</em> or <em>SHA512</em>, this defines the
number of SHA rounds used by the encryption algorithm by default (when
the number of rounds is not specified on the command line).</p>
<p>
With a lot of rounds, it is more difficult to brute force the password.
But note also that more CPU resources will be needed to authenticate
users.</p>
<p>
If not specified, the libc will choose the default number of rounds
(5000), which is orders of magnitude too low for modern hardware.</p>
<p>
The values must be inside the 1000-999,999,999 range.</p>
<p>
If only one of the <strong>SHA_CRYPT_MIN_ROUNDS</strong> or <strong>SHA_CRYPT_MAX_ROUNDS</strong>
values is set, then this value will be used.</p>
<p>
If <strong>SHA_CRYPT_MIN_ROUNDS</strong> &gt; <strong>SHA_CRYPT_MAX_ROUNDS</strong>, the highest value
will be used.</p>
<p>
Note: This only affect the generation of group passwords. The generation
of user passwords is done by PAM and subject to the PAM configuration.
It is recommended to set this variable consistently with the PAM
configuration.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
FILES
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>/etc/group</p>
<blockquote>
<p>Group account information.</p>
</blockquote>
<p>
/etc/gshadow</p>
<blockquote>
<p>Secure group account information.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
SEE ALSO
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>*newgrp*(1), *groupadd*(8), *groupdel*(8), *groupmod*(8), *grpck*(8),
*group*(5), *gshadow*(5).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
